SoapApi (3)/SoapApi/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCustomerRequest>
         <gs:name>1</gs:name>
      </gs:getCustomerRequest>
   </soapenv:Body>
</soapenv:Envelope>